{"format": "graph-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.20.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of48.bin", "group1-shard2of48.bin", "group1-shard3of48.bin", "group1-shard4of48.bin", "group1-shard5of48.bin", "group1-shard6of48.bin", "group1-shard7of48.bin", "group1-shard8of48.bin", "group1-shard9of48.bin", "group1-shard10of48.bin", "group1-shard11of48.bin", "group1-shard12of48.bin", "group1-shard13of48.bin", "group1-shard14of48.bin", "group1-shard15of48.bin", "group1-shard16of48.bin", "group1-shard17of48.bin", "group1-shard18of48.bin", "group1-shard19of48.bin", "group1-shard20of48.bin", "group1-shard21of48.bin", "group1-shard22of48.bin", "group1-shard23of48.bin", "group1-shard24of48.bin", "group1-shard25of48.bin", "group1-shard26of48.bin", "group1-shard27of48.bin", "group1-shard28of48.bin", "group1-shard29of48.bin", "group1-shard30of48.bin", "group1-shard31of48.bin", "group1-shard32of48.bin", "group1-shard33of48.bin", "group1-shard34of48.bin", "group1-shard35of48.bin", "group1-shard36of48.bin", "group1-shard37of48.bin", "group1-shard38of48.bin", "group1-shard39of48.bin", "group1-shard40of48.bin", "group1-shard41of48.bin", "group1-shard42of48.bin", "group1-shard43of48.bin", "group1-shard44of48.bin", "group1-shard45of48.bin", "group1-shard46of48.bin", "group1-shard47of48.bin", "group1-shard48of48.bin"], "weights": [{"name": "padded_conv2d_98/conv2d_98/kernel", "shape": [1, 1, 4, 4], "dtype": "float32"}, {"name": "padded_conv2d_98/conv2d_98/bias", "shape": [4], "dtype": "float32"}, {"name": "padded_conv2d_99/conv2d_99/kernel", "shape": [3, 3, 4, 512], "dtype": "float32"}, {"name": "padded_conv2d_99/conv2d_99/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/group_normalization_61/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/group_normalization_61/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/padded_conv2d_100/conv2d_100/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block/padded_conv2d_100/conv2d_100/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/group_normalization_62/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/group_normalization_62/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block/padded_conv2d_101/conv2d_101/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block/padded_conv2d_101/conv2d_101/bias", "shape": [512], "dtype": "float32"}, {"name": "attention_block/group_normalization_63/gamma", "shape": [512], "dtype": "float32"}, {"name": "attention_block/group_normalization_63/beta", "shape": [512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_102/conv2d_102/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_102/conv2d_102/bias", "shape": [512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_103/conv2d_103/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_103/conv2d_103/bias", "shape": [512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_104/conv2d_104/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_104/conv2d_104/bias", "shape": [512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_105/conv2d_105/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "attention_block/padded_conv2d_105/conv2d_105/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/group_normalization_64/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/group_normalization_64/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/padded_conv2d_106/conv2d_106/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_1/padded_conv2d_106/conv2d_106/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/group_normalization_65/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/group_normalization_65/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_1/padded_conv2d_107/conv2d_107/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_1/padded_conv2d_107/conv2d_107/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/group_normalization_66/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/group_normalization_66/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/padded_conv2d_108/conv2d_108/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_2/padded_conv2d_108/conv2d_108/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/group_normalization_67/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/group_normalization_67/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_2/padded_conv2d_109/conv2d_109/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_2/padded_conv2d_109/conv2d_109/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/group_normalization_68/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/group_normalization_68/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/padded_conv2d_110/conv2d_110/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_3/padded_conv2d_110/conv2d_110/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/group_normalization_69/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/group_normalization_69/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_3/padded_conv2d_111/conv2d_111/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_3/padded_conv2d_111/conv2d_111/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/group_normalization_70/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/group_normalization_70/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/padded_conv2d_112/conv2d_112/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_4/padded_conv2d_112/conv2d_112/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/group_normalization_71/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/group_normalization_71/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_4/padded_conv2d_113/conv2d_113/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_4/padded_conv2d_113/conv2d_113/bias", "shape": [512], "dtype": "float32"}, {"name": "padded_conv2d_114/conv2d_114/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "padded_conv2d_114/conv2d_114/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/group_normalization_72/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/group_normalization_72/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/padded_conv2d_115/conv2d_115/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_5/padded_conv2d_115/conv2d_115/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/group_normalization_73/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/group_normalization_73/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_5/padded_conv2d_116/conv2d_116/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_5/padded_conv2d_116/conv2d_116/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/group_normalization_74/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/group_normalization_74/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/padded_conv2d_117/conv2d_117/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_6/padded_conv2d_117/conv2d_117/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/group_normalization_75/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/group_normalization_75/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_6/padded_conv2d_118/conv2d_118/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_6/padded_conv2d_118/conv2d_118/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/group_normalization_76/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/group_normalization_76/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/padded_conv2d_119/conv2d_119/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_7/padded_conv2d_119/conv2d_119/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/group_normalization_77/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/group_normalization_77/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_7/padded_conv2d_120/conv2d_120/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_block_7/padded_conv2d_120/conv2d_120/bias", "shape": [512], "dtype": "float32"}, {"name": "padded_conv2d_121/conv2d_121/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "padded_conv2d_121/conv2d_121/bias", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_8/group_normalization_78/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_8/group_normalization_78/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_122/conv2d_122/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_122/conv2d_122/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_8/group_normalization_79/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_8/group_normalization_79/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_123/conv2d_123/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_123/conv2d_123/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_124/conv2d_124/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "resnet_block_8/padded_conv2d_124/conv2d_124/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/group_normalization_80/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/group_normalization_80/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/padded_conv2d_125/conv2d_125/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_block_9/padded_conv2d_125/conv2d_125/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/group_normalization_81/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/group_normalization_81/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_9/padded_conv2d_126/conv2d_126/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_block_9/padded_conv2d_126/conv2d_126/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/group_normalization_82/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/group_normalization_82/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/padded_conv2d_127/conv2d_127/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_block_10/padded_conv2d_127/conv2d_127/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/group_normalization_83/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/group_normalization_83/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_10/padded_conv2d_128/conv2d_128/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_block_10/padded_conv2d_128/conv2d_128/bias", "shape": [256], "dtype": "float32"}, {"name": "padded_conv2d_129/conv2d_129/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "padded_conv2d_129/conv2d_129/bias", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_11/group_normalization_84/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_11/group_normalization_84/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_130/conv2d_130/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_130/conv2d_130/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_11/group_normalization_85/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_11/group_normalization_85/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_131/conv2d_131/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_131/conv2d_131/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_132/conv2d_132/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "resnet_block_11/padded_conv2d_132/conv2d_132/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/group_normalization_86/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/group_normalization_86/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/padded_conv2d_133/conv2d_133/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_block_12/padded_conv2d_133/conv2d_133/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/group_normalization_87/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/group_normalization_87/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_12/padded_conv2d_134/conv2d_134/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_block_12/padded_conv2d_134/conv2d_134/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/group_normalization_88/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/group_normalization_88/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/padded_conv2d_135/conv2d_135/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_block_13/padded_conv2d_135/conv2d_135/bias", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/group_normalization_89/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/group_normalization_89/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_block_13/padded_conv2d_136/conv2d_136/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_block_13/padded_conv2d_136/conv2d_136/bias", "shape": [128], "dtype": "float32"}, {"name": "group_normalization_90/gamma", "shape": [128], "dtype": "float32"}, {"name": "group_normalization_90/beta", "shape": [128], "dtype": "float32"}, {"name": "padded_conv2d_137/conv2d_137/kernel", "shape": [3, 3, 128, 3], "dtype": "float32"}, {"name": "padded_conv2d_137/conv2d_137/bias", "shape": [3], "dtype": "float32"}]}]}
